<?php
return [
    "bot_token" => "توکن ربات تلگرام",
    "admin_id" => "آیدی عددی ادمین",
    
    // تنظیمات دیتابیس
    "db_host" => "localhost",
    "db_user" => "نام کاربری دیتابیس",
    "db_pass" => "رمز عبور دیتابیس",
    "db_name" => "نام دیتابیس",

    // تنظیمات IBSng
    "ibsng_url" => "https://ibsng.example.com",
    "ibsng_user" => "ادمین",
    "ibsng_pass" => "رمز ادمین",
    
    //جوین اجباری
    "required_channel" => "@YourChannel", // 🔹 نام کانال اجباری
    "required_group" => "@YourGroup" // 🔹 نام گروه اجباری (در صورت نیاز

];
?>
